       01 RECIN PIC X(35).
       01 PERSON.
          05 FIRST-NAME PIC X(10).
          05 LAST-NAME PIC X(10).
          05 AGE PIC 9(03).
          05 CITY PIC X(10).
          05 STATE PIC X(2).
