        IDENTIFICATION DIVISION.
        PROGRAM-ID. TEST-UNSTRING.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
            01 FULLNAME PIC X(25).
            01 FIRSTNAME PIC X(10).
            01 MIDDLENAME PIC X(5).
            01 LASTNAME PIC X(10).
            01 NUM-FIELDS PIC 9(4) VALUE ZEROES.
        PROCEDURE DIVISION.
            MOVE 'John' TO FULLNAME.
            UNSTRING FULLNAME DELIMITED BY SPACE INTO
                FIRSTNAME MIDDLENAME LASTNAME
                TALLYING IN NUM-FIELDS.

            DISPLAY FIRSTNAME.
            DISPLAY MIDDLENAME.
            DISPLAY LASTNAME.
            DISPLAY NUM-FIELDS.

            STOP RUN.
